In [ ]:
# Groupby Function

In [ ]:
# Groupby allows you to group by rows based off a columns and 
   # allows you to perform an aggregate function on them
# An aggregate function just takes a bunch of values and
   # then spits out or outputs a single value such as the sum
      # of a bunch of values and spits out one value
# So choose a column to groupby, and it gathers rows together,
  # and then you perform an aggregate function on it

In [1]:
import numpy as np
import pandas as pd

In [24]:
# Data copied from Groupby Notebook 
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [25]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [26]:
# Groupby the company 
df.groupby('Company')
# We get a groupby object and points to where it's stored
   # in memory 
# lets store it as a variable

In [27]:
byComp = df.groupby('Company')
byComp

In [28]:
# 2nd step in calling Groupby function is to call an aggregate
   #function on it
# Get average sale by each company 
df.groupby('Company').mean()
# it can'tdo it for person bc person is a 'string'
# PANDAS IGNORES ANYTHING THAT IS NON NUMERIC

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [29]:
# get the sum
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [30]:
# get Std Dev
df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [31]:
# Notice that we get back is a DataFrame with an index called
  # company and a column value of sales
# This mean we can index stuff off of it
# Get the sum of sales for facebook
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [16]:
# COUNT - Count the number of instances per column 
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [17]:
# Max and Min
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [18]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [24]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [23]:
# Groupy with DESCRIBE METHOD - gives you lots of useful info
    # all at once
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [25]:
# We can transpose this if we want
# use if we prefer to have each company as a column instead of
   # an index
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [26]:
# We can call column names off of this if we are interested in
    # a single company 
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [28]:
# ORR
# Can also perform a .loc functon since 'FB' is a row - 
    #   --ie must use .loc
df.groupby('Company').describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [ ]:
#  Part 7 - Merging, Joining, and Concatenating Dataframes

In [ ]:
# How to combine Dataframes through a variety of methods

In [29]:
# Dataframes copied from Video Folder:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [30]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [31]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
# Concatenation - glues together the dataframes
# the dims should match along the axis we want to concat on
# use pd.concat - then pass a list of dataframs to concat together
# By default it joins on the 0 axis - meaning it will join the
   # rows together
# Can also do axis=1 if we want to concat along columns

In [38]:
# Concat df1,df2,df3
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [39]:
# concat on columns (axis=1)
pd.concat([df1,df2,df3],axis=1)
# Most often we join on columns

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [40]:
# Dataframs taken from Notebook
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [42]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [43]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [ ]:
# We see both DFs have the same data for the 'key' column

In [ ]:
# MERGING - allows you to merge DFs together using similar logic
    # as merging SQL tables together
# pd.merge (left,right) - OR DF1,DF@ or just whatever DFs you want
   # to merge together
# by default they will merge by inner 
      # this isn't that important for now
# When we merge we are going to want to merge on a key column - 
   # can pass in one or more key columns which we will see later

In [44]:
# So we will combine or merge the DFs together on the key columm
pd.merge(left,right,how='inner',on='key')
# THIS METHOD ALLOWS YOU TO CONCAT ON A COLUMN BOTH DFS SHARE

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [46]:
# otherwise we get this: which doesn't look good
pd.concat([left,right],axis=1)

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3

In [50]:
# another example
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [51]:
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [52]:
# Merge on multiple keys 
# just pass in a list of keys we want to merge on
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [55]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [56]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [53]:
# Ex 
# Use how = 'outer'
pd.merge(left,right, how='outer', on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [57]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [58]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [59]:
#Ex
# Use how = 'right'
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [ ]:
# IN THIS COURSE WE WILL ONLY USE DEFAULT VALUE OF 'HOW=INNER'

In [ ]:
# JOINING - a convenient method for combining the columns of 2
   # potentially differently-indexed DFs into a single result DF
# Just like merge can specify 'How = '
# Similar to merge except the KEYS you want to join on are on the
   # INDEX instead of a COLUMN

In [60]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [61]:
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [62]:
# So here the actual index are the KEYS we want to join on
# DF1.join(DF2)
# to automatically join the left and right DFs:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [ ]:
#if we want to merge DFs based off one of their columns-Use MERGE

In [65]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [66]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [64]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [ ]:
# Part - 8 - Operations

In [ ]:
import numpy as np
import pandas as pd

In [67]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
# Finding Unique Values in a DF:
# 3 main useful methods for finding unique values in a DF
             #    unique        -returns an array of unique values
             #1- len     of array- returns # unique values
             #2-   nunique()    - returns # of unique values

In [68]:
# Find all unique values in column 2
# Use Unique method
# returns an array of unique values
df['col2'].unique()

array([444, 555, 666])

In [ ]:
# Now lets say instead of an array of the individual unique values
    #we just want the actual number of unique values itself
        #2 methods for this
             #1- len     of array
             #2-   nunique()

In [69]:
# LEN
#returns # unique values
len(df['col2'].unique())

3

In [70]:
# nunique
#returns # unique values
df['col2'].nunique()

3

In [ ]:
# Value COUNTS 
   # if you want a table of unique values and how many times they
       # show up

In [71]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [ ]:
# Selecting Data using CONDITIONAL SELECTION
    # we already talked about Conditional Selection and how 
       # powerful it is as a tool
# Can use Conditional Selection by passing in a conditional 
    # selection statement

In [73]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [74]:
# Return DF where 'col 1' > 2
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [75]:
# Remember this command is just a boolian series
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [ ]:
# Combine Conditions 
# wrap conditions in parethesis 
# use '&' or '|' if you want AND or OR

In [77]:
# Get DF with col1>2    AND     df col2 == 444
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [ ]:
# APPLY METHOD - ONE OF THE MOST POWERFUL TOOLS IN PANDAS
   # APPLY CUSTOM FUNCTION TO A COLUMN

In [80]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [79]:
def times2(x):
    return x*2

In [81]:
#we already know we can grab a column and call a built in 
   #function on it like sum
df['col1'].sum()

10

In [82]:
# But what if we want to apply our own custom function? such as 
   # times2
# DF['column name'].apply(whatever function you want to apply)
df['col1'].apply(times2)
# this will broadcast function to each element in column

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [83]:
# Can also apply built in functions such as LEN
# Find LEN of each STRING in 'col3'
df['col3'].apply(len)
# CAN ONLY DO THIS ON STRINGS

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
# APPLY very powerful when you combine it with LAMBDA expressions
# Better to do this in one line for stuff we just apply once

In [86]:
# Create Lambda expression for 'TIMES2'
df['col2'].apply(lambda x: x*2)
# WILL USE THIS ALL THE TIME

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [87]:
# Removing Columns
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [89]:
# Remove column 1
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [91]:
# If you want to get the column and index names off a DF
   # these are ATTRIBUTES - meaning we can do this:
df.columns
# this returns an index object which is a list of column names
# Very usefull when you want to index a column and may 
   # spacing is wierd or something

Index(['col1', 'col2', 'col3'], dtype='object')

In [92]:
# We can do same thing with index
df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
# SORT VALUES - Sorting and Ordering a DF
  # Can sort off rows or columns

In [93]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [95]:
# Sort DF by column 2
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [96]:
# OR
df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [ ]:
# NULL VALUES - Useful method to find NULL values in DF is:
   # df.isnull()

In [97]:
df.isnull()
# returns DF of Boolians

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [ ]:
# PIVOT TABLE
  # really familiar for advances EXCEL users
  # We won't use this that much in course but we will use it 
    # later when we do HeatMaps

In [98]:
# Copied from notebook
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df
# We notice we have repeating values in every column

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [99]:
# We will create a multi index out of this DF
# method to do this is PIVOT TABLE
# Pivot 3 main arguments:
    # 1-values , 2-index,  3-columns
# Lets say we want D-values in table
# 'A' and 'B' will be a multi level index
# Columns defined by 'C' - so we will have 2 columns in this case
    # since we have 'x' and 'y' under 'C'
df.pivot_table(values='D',index=['A','B'],columns=['C'])
# so we get 2 indexes and 2 columns (since C has two values),
   # and values from 'D'
# We get NULL values where there is nothing for ex- there is 
   # nothing for bar-two-x - but we do find bar-two-y

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [ ]:
# Part 9 - Data Input and Output

In [ ]:
# Pandas can read in Data from a variety of sources
# We will focus on reading data from:
    # 1-CSVs,  2-Excel,  3-HTML,  4-SQL
    
# In order to work with HTML and SQL files need to install 
    # 4 libraries: sqlalchemy, lxml, html5lib, beautifulSoup4
        # We can install these with PIP or CONDA
#conda install sql alchemy
#conda install lxml
#conda install html5lib
#conda install BeautifulSoup4

In [2]:
import pandas as pd

In [100]:
#Check location of jupyter notebook
pwd

'/Users/thomascoenen/Documents/Udemy/PythonForDataScienceBC/Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas'

In [12]:
# Read CSV:
pd.read_csv('example.csv')

In [ ]:
# Write to a CSV 
# create DF first
df = pd.read_csv('example.csv')

# Write to CSV
# we don't want old index saved in our new file
df.to_csv('My_output',index=False)

In [3]:
#Read and Write Excel Files
#Sheetname is indiviual sheet name for  excel file to convert to DF
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [14]:
df = pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

In [ ]:
#Writing a DF to an excel output
df.to_excel('Excel_sample2.xlsx', sheet_name='NewSheet')

In [ ]:
# Working with HTML

In [4]:
# Copy HTML link and read into pandas
# This data is the FDIC list of failed banks in the USA
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [5]:
# Pandas will read in data and try to convert to Lists
# Pandas will try and find every 'TABLE' element in HTML doc
  #and convert each item in table into a DF(and will be list)
type(data)

list

In [6]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [8]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [9]:
# Working with SQL
# Pandas probably isn't the best source to read into pandas
   # directly
# We will build a very simple SQL engine to show you how you
   # can read SQL tables as DFs
from sqlalchemy import create_engine
   # this helps us to create a very simple SQL engine in
        #memory

In [10]:
# Create a very small SQL lite engine database that runs in 
   #memory
engine = create_engine('sqlite:///:memory:')

In [16]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [15]:
# Write DF to our memory
# Pass in new table name we want
#  and 'connection' to our SQL engine
df.to_sql('my_table', engine)

In [17]:
# Read back our table
sqldf = pd.read_sql('my_table', con=engine)

In [18]:
sqldf

   index  Unnamed: 0   a   b   c   d
0      0           0   0   1   2   3
1      1           1   4   5   6   7
2      2           2   8   9  10  11
3      3           3  12  13  14  15